@nitrocode  - line 14 has missing  `[k]` in `local.posix_users`

```
  # module.efs.aws_efs_access_point.default["data"] will be created
  + resource "aws_efs_access_point" "default" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "Name" = "data"
        }
      + tags_all        = {
          + "Name" = "data"
        }

      + posix_user {
          + gid = 1001
          + uid = 5000
        }

      + root_directory {
          + path = "/data"

          + creation_info {
              + owner_gid   = 1001
              + owner_uid   = 5000
              + permissions = "0755"
            }
        }
    }
```

After the suggested changes it looks like below
```
  # module.efs.aws_efs_access_point.default["data"] will be created
  + resource "aws_efs_access_point" "default" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "Name" = "data"
        }
      + tags_all        = {
          + "Name" = "data"
        }

      + posix_user {
          + gid            = 1001
          + secondary_gids = [
              + 1002,
              + 1003,
            ]
          + uid            = 5000
        }

      + root_directory {
          + path = "/data"

          + creation_info {
              + owner_gid   = 1001
              + owner_uid   = 5000
              + permissions = "0755"
            }
        }
    }
```